In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
data=pd.read_csv("H:\\dataPython\\Salary_Data.csv")

In [4]:
data.head(10)

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0
5              2.9  56642.0
6              3.0  60150.0
7              3.2  54445.0
8              3.2  64445.0
9              3.7  57189.0

In [5]:
data.describe()

       YearsExperience         Salary
count        30.000000      30.000000
mean          5.313333   76003.000000
std           2.837888   27414.429785
min           1.100000   37731.000000
25%           3.200000   56720.750000
50%           4.700000   65237.000000
75%           7.700000  100544.750000
max          10.500000  122391.000000

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  30 non-null     float64
 1   Salary           30 non-null     float64
dtypes: float64(2)
memory usage: 608.0 bytes

In [53]:
x=data.YearsExperience

In [54]:
x

0      1.1
1      1.3
2      1.5
3      2.0
4      2.2
5      2.9
6      3.0
7      3.2
8      3.2
9      3.7
10     3.9
11     4.0
12     4.0
13     4.1
14     4.5
15     4.9
16     5.1
17     5.3
18     5.9
19     6.0
20     6.8
21     7.1
22     7.9
23     8.2
24     8.7
25     9.0
26     9.5
27     9.6
28    10.3
29    10.5
Name: YearsExperience, dtype: float64

In [55]:
y=data.Salary

In [56]:
y

0      39343.0
1      46205.0
2      37731.0
3      43525.0
4      39891.0
5      56642.0
6      60150.0
7      54445.0
8      64445.0
9      57189.0
10     63218.0
11     55794.0
12     56957.0
13     57081.0
14     61111.0
15     67938.0
16     66029.0
17     83088.0
18     81363.0
19     93940.0
20     91738.0
21     98273.0
22    101302.0
23    113812.0
24    109431.0
25    105582.0
26    116969.0
27    112635.0
28    122391.0
29    121872.0
Name: Salary, dtype: float64

In [57]:
#Rescalling
x=(x-x.mean())/x.std()

In [58]:
data.isnull()

     Ones  YearsExperience  Salary
0   False            False   False
1   False            False   False
2   False            False   False
3   False            False   False
4   False            False   False
5   False            False   False
6   False            False   False
7   False            False   False
8   False            False   False
9   False            False   False
10  False            False   False
11  False            False   False
12  False            False   False
13  False            False   False
14  False            False   False
15  False            False   False
16  False            False   False
17  False            False   False
18  False            False   False
19  False            False   False
20  False            False   False
21  False            False   False
22  False            False   False
23  False            False   False
24  False            False   False
25  False            False   False
26  False            False   False
27  False            False   False
28  False            False   False
29  False            False   False

In [59]:
data.isnull().sum()

Ones               0
YearsExperience    0
Salary             0
dtype: int64

In [60]:
x=np.matrix(x)

In [61]:
x

matrix([[-1.48467209, -1.41419715, -1.34372221, -1.16753485, -1.09705991,
         -0.85039762, -0.81516015, -0.74468521, -0.74468521, -0.56849786,
         -0.49802292, -0.46278544, -0.46278544, -0.42754797, -0.28659809,
         -0.14564821, -0.07517327, -0.00469833,  0.20672649,  0.24196396,
          0.52386373,  0.62957614,  0.9114759 ,  1.01718831,  1.19337566,
          1.29908808,  1.47527543,  1.5105129 ,  1.75717519,  1.82765013]])

In [62]:
y=np.matrix(y)

In [63]:
y

matrix([[ 39343.,  46205.,  37731.,  43525.,  39891.,  56642.,  60150.,
          54445.,  64445.,  57189.,  63218.,  55794.,  56957.,  57081.,
          61111.,  67938.,  66029.,  83088.,  81363.,  93940.,  91738.,
          98273., 101302., 113812., 109431., 105582., 116969., 112635.,
         122391., 121872.]])

In [65]:
data=data.insert(0,'Ones',1)

ValueError: cannot insert Ones, already exists